/*
 * 자바의 기초 문법 이해 하기.
 * 
 *  1. 자바는 클래스 기반 언어이기 때문에 반드시 클래스라는 키워드로 소스가 시작되어야 합니다.
 *  다음에 공백 하나를 주고, 클래스명을 넣는데, 이때는 반드시 영대문자로 시작합니다. 한글 지원되지만, 아무도 사용하지 않습니다.
 *  숫자사용가능하지만 클래스명 첫머리엔 불가능합니다. 즉 두번째 이후 부터 가능합니다. 특수문자는 _,$ 만 허용 가능합니다.
 *  
 *  2. 클래스명이든 뭐든, 모든 이름은 캐멀스타일을 적용하세요.
 *  3. 클래스명 다음엔 클래스를 정의 하는 {}를 선언합니다. 반드시 열면 닫아야 합니다.
 *  4. 이렇게 클래스를 정의한 내용이 있는 {} 을 클래스 바디 라고 합니다.
 *  5. 필요하다면 하나의 소스 파일에 하나 이상의 클래스를 정의 할 수 있습니다.
 *  이때, public 이라는 키워드는 main 을 보유하고 있는 클래스 하나만이 가질 수 있습니다.
 */
public class SyntaxEx { //클래스 바디
	
	public static void main(String[] args) { //메서드 바디
	 //	TODO Auto-generated method stub
	}

}
class Mycls{
	
}

class YourCls{

}
class HisCls{
	
}